<?php
defined('EMLOG_ROOT') || exit('access denied!');
?>
    <div class="joe_container joe_bread">
        <ul class="joe_bread__bread">
            <li class="item">
                <svg class="icon" viewBox="0 0 1024 1024">
                    <path d="M307.867 805.441h408.266V575.792c0-15.31 29.344-22.046 44.654-22.046 15.336 0 27.762 12.426 27.762 27.762v277.544c0 15.335-12.426 27.762-27.762 27.762h-499.59c-15.31 0-27.762-12.427-27.762-27.762V581.507c0-15.31 12.426-27.762 27.762-27.762 15.31 0 46.67 6.71 46.67 22.046v229.65zM205.8 524.758c-10.845 10.845-56.851 3.93-67.696-6.89a27.762 27.762 0 0 1-.025-39.295l353.253-353.227a27.762 27.762 0 0 1 39.296 0L883.93 478.573a27.813 27.813 0 0 1-12.478 46.491c-9.568 2.552-46.236 6.686-53.253-.331L512 218.559 205.8 524.758z"/>
                </svg>
                <a href="<?= BLOG_URL; ?>" class="link" title="首页">首页</a>
            </li>
            <li class="line">/</li>
            <?php neirong_sort($logid); ?>
            <li class="line">/</li>
            <li class="item">正文</li>
        </ul>
    </div>
    <div class="joe_container">
    <div class="joe_main joe_post">
        <div class="joe_detail" data-cid="110">
            <div class="joe_detail__category">
                <?php neirong1_sort($logid); ?>
                <?php editflg($logid, $author); ?>
            </div>
            <h1 class="joe_detail__title">
                <?= $log_title; ?>
            </h1>
            <div class="joe_detail__count">
                <div class="joe_detail__count-information">
                    <img width="35" height="35" class="avatar ls-is-cached lazyloaded" src="<?php $user_cache = $CACHE->readCache('user');
                    echo empty($user_cache[$author]['avatar']) ? BLOG_URL . 'admin/views/images/avatar.jpg' : BLOG_URL . $user_cache[$author]['avatar']; ?>"
                         data-src="<?php $user_cache = $CACHE->readCache('user');
                         echo empty($user_cache[$author]['avatar']) ? BLOG_URL . 'admin/views/images/avatar.jpg' : BLOG_URL . $user_cache[$author]['avatar']; ?>">
                    <div class="meta">
                        <div class="author">
                            <?php blog_author($author); ?>
                        </div>
                        <div class="item">
                            <span class="text"><?= date('Y-n-j', $date) ?></span>
                            <span class="line">/</span>
                            <span class="text"><?= ($comnum); ?> 评论</span>
                            <span class="line">/</span>
                            <span class="text" id="Joe_Article_Views"><?= $views; ?> 阅读</span>
                        </div>
                    </div>
                </div>
                <time class="joe_detail__count-created" datetime="<?= gmdate('m/d', $date); ?>"><?= gmdate('m/d', $date); ?></time>
            </div>
            <article class="joe_detail__article">
                <?php $time = strtotime(gmdate('Y-n-j', $date));
                $now = time();
                $t = $now - $time;
                if ($t > 3600 * 24 * 180) { ?>
                    <div class="joe_detail__overdue">
                        <div class="joe_detail__overdue-wrapper">
                            <div class="title">
                                <svg class="icon" viewBox="0 0 1024 1024" width="20" height="20">
                                    <path d="M0 512c0 282.778 229.222 512 512 512s512-229.222 512-512S794.778 0 512 0 0 229.222 0 512z" fill="#FF8C00" fill-opacity=".51"></path>
                                    <path d="M462.473 756.326a45.039 45.039 0 0 0 41.762 28.74 45.039 45.039 0 0 0 41.779-28.74h-83.541zm119.09 0c-7.73 35.909-39.372 62.874-77.311 62.874-37.957 0-69.598-26.965-77.33-62.874H292.404a51.2 51.2 0 0 1-42.564-79.65l23.723-35.498V484.88a234.394 234.394 0 0 1 167.492-224.614c3.635-31.95 30.498-56.815 63.18-56.815 31.984 0 58.386 23.808 62.925 54.733A234.394 234.394 0 0 1 742.093 484.88v155.512l24.15 36.454a51.2 51.2 0 0 1-42.668 79.48H581.564zm-47.957-485.922c.069-.904.12-1.809.12-2.73 0-16.657-13.26-30.089-29.491-30.089-16.214 0-29.474 13.432-29.474 30.089 0 1.245.085 2.491.221 3.703l1.81 15.155-14.849 3.499a200.226 200.226 0 0 0-154.265 194.85v166.656l-29.457 44.1a17.067 17.067 0 0 0 14.182 26.556h431.155a17.067 17.067 0 0 0 14.234-26.487l-29.815-45.04V484.882A200.21 200.21 0 0 0 547.26 288.614l-14.985-2.986 1.331-15.224z"
                                          fill="#FFF"></path>
                                    <path d="M612.864 322.697c0 30.378 24.303 55.022 54.272 55.022 30.003 0 54.323-24.644 54.323-55.022 0-30.38-24.32-55.023-54.306-55.023s-54.306 24.644-54.306 55.023z" fill="#FA5252"></path>
                                </svg>
                                <span class="text">温馨提示：</span>
                            </div>
                            <div class="content">
                                本文最后更新于
                                <?= gmdate('Y-n-j', $date); ?>，已超过半年没有更新，若内容或图片失效，请留言反馈。
                            </div>
                        </div>
                    </div>
                    </br>
                <?php } ?>
                <?= $log_content; ?>
                <?php doAction('log_related', $logData); ?>
            </article>
            <div class="joe_detail__agree">
                <a class="slzanpd" data-slzanpd="<?= $logData['logid']; ?>" title="喜欢这篇文章就赞一个吧！">
                    <div class="agree">
                        <div>
                            <svg class="like icon-2" viewBox="0 0 1024 1024" onclick="document.body.classList.toggle('liked')" width="40" height="40">
                                <path d="M736 128c-65.952 0-128.576 25.024-176.384 70.464-4.576 4.32-28.672 28.736-47.328 47.68L464.96 199.04C417.12 153.216 354.272 128 288 128 146.848 128 32 242.848 32 384c0 82.432 41.184 144.288 76.48 182.496l316.896 320.128C450.464 911.68 478.304 928 512 928s61.568-16.32 86.752-41.504l316.736-320 2.208-2.464C955.904 516.384 992 471.392 992 384c0-141.152-114.848-256-256-256z" fill="#fff"></path>
                            </svg>
                        </div>
                        <span class="text"><?= (isset($logData['slzan']) ? $logData['slzan'] : getnum($logData['logid'])); ?></span>
                    </div>
                </a>
            </div>
            <div class="joe_detail__operate">
                <div class="joe_detail__operate-tags">
                    <?php blog_tag($logid); ?>
                </div>

                <div class="joe_detail__operate-share" style="margin-left:5px;">
                    <svg viewBox="0 0 1024 1024" width="26" height="26">
                        <path d="M13.4 512.8c0 276 224 500 500 500s500-224 500-500-224-500-500-500c-276.6 0-500 224-500 500z" fill="#1296DB"></path>
                        <path d="M513.4 233.8c13 0 23.8 10.6 23.8 23.8 0 13-10.6 23.8-23.8 23.8-128 0-231.6 103.8-231.6 231.6s103.8 231.6 231.6 231.6S745 640.8 745 513c-.4-13 9.8-24 22.8-24.6 13-.4 24 9.8 24.6 22.8v1.6c0 154-125 279-279 279s-279-125-279-279 125-279 279-279zM657 352.4c-8.6-9.6-7.8-24.4 1.8-33 9-8 22.6-8 31.4.2l40.8 40.8c12.4 12.2 12.4 32.2 0 44.6l-40.8 41c-9.4 8.8-24 8.6-33-.8-8.6-9-8.6-23.2 0-32.2l7-7h-30c-81.8 0-109.6 34.8-109.6 140.2 0 12.8-10.4 23.2-23.2 23.2-12.8 0-23.2-10.4-23.2-23.2 0-130.2 47.6-186.8 156.2-186.8h30l-7.4-7z"
                              fill="#FFF"></path>
                    </svg>
                    <div class="reach">
                        <a href="//connect.qq.com/widget/shareqq/index.html?url=<?= Url::log($logid); ?>&title=<?= $log_title; ?>&pics=<?= $imgurl; ?>" target="_blank" rel="noopener noreferrer" title="分享到QQ">
                            <svg class="icon" viewBox="0 0 1024 1024" width="30" height="30">
                                <path d="M512 73.28A438.72 438.72 0 1 0 950.72 512 438.72 438.72 0 0 0 512 73.28zM759.84 646.4c-9.6 8.16-20.8-6.08-29.76-20.32s-14.88-26.72-16-21.76a158.4 158.4 0 0 1-37.44 70.72c-1.28 1.6 28.8 12.48 37.44 35.68s24 57.6-80 68.8a145.76 145.76 0 0 1-80-16c-16.96-8.32-27.52-16-29.6-16a73.6 73.6 0 0 1-13.28 0 108 108 0 0 1-14.4 0c-1.76 0-22.24 32-113.12 32-70.4 0-88.64-44.32-74.4-68.8s37.76-32 34.4-35.36a192 192 0 0 1-34.4-57.6 98.56 98.56 0 0 1-4.16-13.44c-1.28-4.64-6.56 8.64-13.92 21.76s-14.4 22.72-22.88 22.72a11.52 11.52 0 0 1-6.56-2.4c-20.96-16-19.2-55.2-5.44-93.12s48-75.04 48-83.2c1.28-30.24-3.04-35.2 0-43.2 6.56-17.76 14.72-10.88 14.72-20.16 0-116.32 86.4-210.56 192.96-210.56s192.96 94.24 192.96 210.56c0 4.48 11.68 0 17.12 20.16a196.96 196.96 0 0 1 0 43.2c0 11.04 29.44 24.48 44.8 83.2S768 640 759.84 646.4z"
                                      fill="#68A5E1"></path>
                            </svg>
                        </a>
                        <a href="//sns.qzone.qq.com/cgi-bin/qzshare/cgi_qzshare_onekey?url=<?= Url::log($logid); ?>&sharesource=qzone&title=<?= $log_title; ?>&pics=<?= $imgurl; ?>" target="_blank" rel="noopener noreferrer" title="分享到QQ空间">
                            <svg class="icon" viewBox="0 0 1024 1024" width="30" height="30">
                                <path d="M512 73.28A438.72 438.72 0 1 0 950.72 512 438.72 438.72 0 0 0 512 73.28zM829.92 432c5.6 16-150.24 146.4-150.24 146.4s2.08 12.64 4.16 22.08c0 0-72.64 2.24-132.32 0-32-1.28-69.12-7.04-69.12-7.04L656 470.24a1005.44 1005.44 0 0 0-125.76-13.6A908 908 0 0 0 380 463.36c-6.4 1.76 44.8 1.6 103.04 6.88 40.8 3.68 94.56 13.44 94.56 13.44l-172.8 128s73.92 4.48 140.32 4.16c74.72 0 142.24-9.92 142.72-8 12.96 56.16 36.96 167.52 28 176-12.16 12.32-185.6-97.6-185.6-97.6S368 785.6 345.92 785.6a3.68 3.68 0 0 1-2.08 0c-10.72-8.8 35.52-206.72 35.52-206.72S222.72 448 229.12 432s208-30.24 208-30.24 74.88-188 92.48-188 92.8 188 92.8 188S824.32 416 829.92 432z"
                                      fill="#F5BE3F"></path>
                            </svg>
                        </a>
                        <a href="http://service.weibo.com/share/share.php?sharesource=weibo&title=<?= $log_title; ?>，来自：<?= Url::log($logid); ?>&pic=<?= $imgurl; ?>" target="_blank" rel="noopener noreferrer" title="分享到新浪微博">
                            <svg class="icon" viewBox="0 0 1024 1024" width="30" height="30">
                                <path d="M480.8 457.76a271.04 271.04 0 0 0-37.28 2.72c-96 13.44-166.72 75.04-157.92 137.44s93.6 101.92 189.6 88.48 166.72-75.04 157.92-137.44c-7.68-54.08-73.12-91.04-152.32-91.2zm-23.36 211.52a122.08 122.08 0 0 1-24 2.4c-48 0-88-27.52-96-68.32-9.28-48 29.44-95.2 86.56-106.24s110.88 18.4 120 66.08-29.44 95.04-86.56 106.08z" fill="#F56467"></path>
                                <path d="M512 73.28A438.72 438.72 0 1 0 950.72 512 438.72 438.72 0 0 0 512 73.28zm-43.84 666.88c-150.24 0-272-78.56-272-176S378.56 314.72 448 314.72c29.28 0 86.56 21.76 46.4 90.88a246.24 246.24 0 0 0 34.08-10.08c32-9.12 76.96-18.24 107.68 0 51.04 29.6 0 77.12 0 82.4s102.4 5.28 102.4 87.2c.32 96.48-120.16 175.04-270.4 175.04zm213.76-358.88a56 56 0 0 0-47.2-16 16.96 16.96 0 0 1-17.28-14.4 12.16 12.16 0 0 0 0 2.4v-4.8a12.16 12.16 0 0 0 0 2.4 20.48 20.48 0 0 1 17.28-17.28 77.28 77.28 0 0 1 68.32 18.56c32 28.48 18.72 75.68 18.72 75.68a21.28 21.28 0 0 1-20.48 17.28h-1.76a12.48 12.48 0 0 1-12.8-16.8 49.44 49.44 0 0 0-4.8-47.04zm120.16 60.64A29.6 29.6 0 0 1 776 467.84a22.08 22.08 0 0 1-19.68-25.92A139.2 139.2 0 0 0 736 336c-34.88-50.08-109.92-41.28-109.92-41.28A26.24 26.24 0 0 1 599.84 272v2.88-5.6V272a26.56 26.56 0 0 1 26.24-23.52 188.32 188.32 0 0 1 136.16 47.04c58.08 55.04 39.84 146.4 39.84 146.4z"
                                      fill="#F56467"></path>
                                <path d="M459.36 547.04a17.6 17.6 0 1 0 17.6 17.6 17.6 17.6 0 0 0-17.6-17.6zm-44.32 23.2a43.52 43.52 0 0 0-18.4 4.32A32 32 0 0 0 376 613.12a32 32 0 0 0 42.88 9.12 32 32 0 0 0 20.64-38.72 25.76 25.76 0 0 0-24.48-13.28z" fill="#F56467"></path>
                            </svg>
                        </a>
                    </div>
                </div>
            </div>
            <div class="joe_detail__copyright">
                <div class="content">
                    <div class="item">
                        <svg class="icon" width="20" height="20" viewBox="0 0 1024 1024">
                            <path d="M614.72 554.538c-49.086-6.399-100.27-2.1-149.256-2.1-119.465 0-209.04 95.972-206.84 215.437 0 17.095 8.498 31.99 23.493 40.488 14.896 10.697 34.09 14.896 53.285 17.095 61.882 6.398 123.664 6.398 198.342 6.398 40.488 0 93.872-2.1 142.858-4.298 27.692 0 53.284-4.3 78.877-14.896 19.194-8.498 29.89-19.194 31.99-40.488 8.498-104.57-72.478-204.84-172.75-217.636zM680.8 375.39c0-87.474-74.678-162.053-164.251-162.053-89.574 0-162.053 74.679-162.053 162.053-2.1 87.474 74.678 164.252 162.053 164.252 89.673 0 164.252-74.678 164.252-164.252z"
                                  fill="#FFF"></path>
                            <path d="M512.35 0C228.733 0 .5 228.233.5 511.85s228.233 511.85 511.85 511.85 511.85-228.233 511.85-511.85S795.967 0 512.35 0zm275.12 772.074c-2.1 21.294-12.797 31.99-31.991 40.488-25.593 10.697-51.185 14.896-78.877 14.896-49.086 2.099-102.37 4.298-142.858 4.298-74.678 0-136.46 0-198.342-6.398-19.195-2.1-38.389-6.398-53.285-17.095-14.895-8.497-23.493-23.493-23.493-40.488-2.1-119.465 87.475-215.437 206.84-215.437 49.085 0 100.27-4.299 149.256 2.1 100.27 12.896 181.247 113.166 172.75 217.636zM354.495 375.39c0-87.474 72.479-162.053 162.053-162.053S680.8 288.016 680.8 375.39c0 89.574-74.679 164.252-164.252 164.252-87.375 0-164.152-76.778-162.053-164.252z"
                                  fill="#249FF8"></path>
                        </svg>
                        <span>版权属于：</span>
                        <span class="text"><?php blog_author1($author); ?></span>
                    </div>
                    <div class="item">
                        <svg class="icon" width="20" height="20" viewBox="0 0 1024 1024">
                            <path d="M511.854 0A511.854 511.854 0 1 0 1024 511.854 511.854 511.854 0 0 0 511.854 0z" fill="#39B54A"></path>
                            <path d="M576.491 630.355L460.028 746.818a129.565 129.565 0 0 1-182.555 0l-2.038-2.038a128.983 128.983 0 0 1 0-182.264l81.233-81.233a179.644 179.644 0 0 0 13.102 70.46l-52.7 52.408a69.878 69.878 0 0 0 0 98.703l2.038 2.038a70.169 70.169 0 0 0 98.703 0l116.463-116.463a69.878 69.878 0 0 0 0-98.703l-2.039-2.038a69.587 69.587 0 0 0-13.975-10.772l42.509-42.51a128.11 128.11 0 0 1 13.102 11.356l2.038 2.038a129.274 129.274 0 0 1 0 182.264z" fill="#FFF"></path>
                            <path d="M746.236 460.902l-81.233 81.233a179.353 179.353 0 0 0-13.102-70.46l52.7-52.409a69.878 69.878 0 0 0 0-98.702l-2.039-2.038a69.878 69.878 0 0 0-98.702 0L487.397 434.989a69.878 69.878 0 0 0 0 98.702l2.038 2.038a68.422 68.422 0 0 0 13.976 10.773l-42.51 42.51a136.553 136.553 0 0 1-13.101-11.356l-2.038-2.038a128.983 128.983 0 0 1 0-182.265l116.463-116.462a129.565 129.565 0 0 1 182.555 0l2.038 2.038a128.983 128.983 0 0 1 0 182.264z" fill="#FFF"></path>
                        </svg>
                        <span>本文链接：</span>
                        <span class="text"><a class="link" href="<?= Url::log($logid); ?>" target="_blank" rel="noopener noreferrer nofollow"><?= Url::log($logid); ?></a></span>
                    </div>
                    <div class="item">
                        <svg class="icon" width="20" height="20" viewBox="0 0 1024 1024">
                            <path d="M0 512a512 512 0 1 0 1024 0A512 512 0 1 0 0 512z" fill="#F3B243"></path>
                            <path d="M540.672 323.584a90.112 90.112 0 1 0 180.224 0 90.112 90.112 0 1 0-180.224 0zM540.672 688.128a90.112 90.112 0 1 0 180.224 0 90.112 90.112 0 1 0-180.224 0zM229.376 512a90.112 90.112 0 1 0 180.224 0 90.112 90.112 0 1 0-180.224 0z" fill="#FFF"></path>
                            <path d="M341.037 480.37l257.344-175.718 27.713 40.592-257.34 175.718z" fill="#FFF"></path>
                            <path d="M349.053 488.452L601.907 670.56l-28.725 39.887L320.307 528.34z" fill="#FFF"></path>
                        </svg>
                        <span>文章声明：</span>
                        <span class="text">本文版权内容属于《<?= $blogname; ?>》转载请标明出处</span>
                    </div>
                </div>
            </div>
            <div class="joe_detail__related">
                <div class="joe_detail__related-title">相关推荐</div>
                <div class="joe_detail__related-content">
                    <?php
                    $Log_Model = new Log_Model();
                    $log = $Log_Model->getLogsForHome("AND sortid =$sortid ORDER BY rand() ASC", 0, 4);
                    if ($log) {
                        foreach ($log as $value) {
                            ?>
                            <?php
                            if (!empty($value['cover'])) {
                                $imgurl = $value['cover'];
                            } elseif (img_ns($value['content'])) {
                                $imgurl = img_ns($value['content']);
                            } else {
                                $imgurl = _g('appearance-suolt');
                            }
                            ?>
                            <a class="item" href="<?= $value['log_url']; ?>" title="<?= $value['log_title']; ?>">
                                <img class=" lazyloaded" src="<?= $imgurl; ?>" data-src="<?= $imgurl; ?>" alt="<?= $value['log_title']; ?>">
                                <h6><?= $value['log_title']; ?></h6>
                            </a>
                        <?php }
                    } ?>
                </div>
            </div>
        </div>
        <ul class="joe_post__pagination">
            <?php joe_nextprve($date, $sortid);
            ?>
        </ul>
        <?php blog_comments_post($logid, $ckname, $ckmail, $ckurl, $verifyCode, $allow_remark);
        ?>
        <ol class="comment-list">
            <?php blog_comments($comments, $params);
            ?>
        </ol>
    </div>
<?php include View::getView('side'); ?>
<?php include View::getView('footer'); ?>